# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

# Пример:

# - 6 -> да
# - 7 -> да
# - 1 -> нет
# from random import randint
# week_day = int(input())

# if week_day == 7 or week_day == 6:
#     print('Yes')
# else:
#     print('No')
#     Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

# Пример:

# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21
# from math import *
# x1 = int(input('Введите первую координату первой точки: '))
# y1 = int(input('Введите вторую координату первой точки: '))
# x2 = int(input('Введите первую координату второй точки: '))
# y2 = int(input('Введите вторую координату второй точки: '))
# print(sqrt((x1  - y1) ** 2 + (x2  - y2 ) ** 2))

